# старт
start_text = "Привет! Зарегистрируйся, чтобы пользоваться ботов. Для начала - отправьте свой контакт!"

# контакт
accept_text = "Ваш статус Партнера подтвержден. Продолжите регистрацию.\nВведите свой email:"
decline_text = "Вам необходимо получить статус Партнера. Пожалуйста, обратитесь к <a href='https://t.me//akulovrus'>Администратору</a> Аукциона."

# email
accept_email = "Email принят! Введите свои имя и фамилию"
decline_email = "[❌] Не похоже на почту. Попробуйте ещё раз."
# ФИ
accept_fi = "Укажите пол"
decline_fi = "[❌] Не похоже на [имя/фамилию]. Попробуйте еще раз"

# Гендер
accept_gender = "Укажите возраст"
decline_gender = "[❌] Не похоже ни на один из ответов. Попробуйте еще раз"

# Возраст
accept_age = "Загрузите ваше фото"
decline_age = "[❌] Не похоже на возраст. Попробуйте еще раз"

# Аватар
accept_avatar = "Выберите ваш регион"
decline_text_avatar = "[❌] Не похоже на файл. Загрузите пожалуйста фото в формате jpg, jpeg или png"
decline_avatar = "[❌] Не похоже на нужный формат. Загрузите пожалуйста фото в формате jpg, jpeg или png"

# Регионы
accept_region = "Укажите компанию, в которой Вы работаете."

# Компания
accept_company = "Регистрация успешно пройдена. Теперь Вы можете пользоваться ботом"
decline_company = "[❌] Не похоже на компанию. Попробуйте еще раз"

# Правила
auction_rules = "ПРАВИЛА АУКЦИОНА ДЛЯ ПОЛЬЗОВАТЕЛЕЙ:\n\n" \
                 "Чтобы просматривать аукционы и делать ставки, необходимо заполнить простую форму регистрации в БОТе.\n" \
                 "Далее смотрите лоты и выбираете любой понравившийся.\n\n" \
                 "<b>Оповещения о проведении Аукциона</b>\n" \
                 "Ежедневно с пн.-пт. в 19:00 вам будет поступать уведомление о завтрашних торгах.\n" \
                 "В день проведения торгов в 12:00 будет приходить уведомление о начале торгов.\n" \
                 "За 10 минут до окончания торгов, в 12:50, придет уведомление о скором завершении торгов.\n\n" \
                 "<b>Как делать ставку?</b>\n" \
                 "У каждого выставленного лота есть стартовая цена. Чтобы сделать ставку, нужно нажать на кнопку «+250 руб. для r 13-17» или «+500 руб. для r 18+». " \
                 "Подтвердить ее. После этого цена увеличится на 250/500 руб. по вашей ставке. Если вашу ставку никто не перебьет, победа ваша! " \
                 "Аукцион длится от 1 час, но последняя ставка автоматически продлевает розыгрыш на 1 минуту.\n\n" \
                 "<b>Можно ли отменить ставку?</b>\n" \
                 "Отменить ставку после ее подтверждения нельзя.\n\n" \
                 "<b>Как добавить лот в избранное?</b>\n" \
                 "Чтобы добавить лот в избранное и следить за ходом аукциона, нужно нажать на кнопку '💾'.\n\n" \
                 "<b>Когда закончится аукцион?</b>\n" \
                 "Чтобы узнать, когда закончится аукцион, необходимо нажать на кнопку '⏳'. Время до конца аукциона отобразится во всплывающем окне.\n\n" \
                 "<b>Как оплатить выигранный ЛОТ:</b>\n" \
                 "Оплатить ЛОТ можно безналичным расчетом или по QR, который Менеджер Аукциона пришлет вам после завершения Торгов.\n\n" \
                 "<b>Когда и где забирать шины?</b>\n" \
                 "Получить шины вы можете с 09:00 до 21:00 в одном из наших дилерских центров.\n\n" \
                 "Если победитель аукциона не оплачивает ЛОТ в течение одного часа - шины передаются следующему участнику.\n\n" \
                 "<b>Участник блокируется в системе при одном из нарушений:</b>\n" \
                 "  - В случае отказа приобрести шины по необъективным причинам.\n" \
                 "  - В случае удерживания окна подтверждения ставки дольше 20 секунд, а также отмены подтверждения и нажатия на него ещё раз.\n" \
                 "  - В случае накручивания ставок.\n" \
                 "  - При неподтверждении победной ставки более 2 раз.\n" \
                 "  - При размещении шин в продажу на Авито, Авто.ру и других площадках до выкупа шин - пользователь блокируется в системе вне зависимости от количества предупреждений."


# админка
accept_admin = "Вы админ, вам доступен весь функционал"
admin_text = "Админка"
admin_add_partner = "Введите номер телефона партнёра или отправьте его контакт"
admin_add_admin = "Введите номер телефона админа или отправьте его контакт"
admin_delete_partner = "Введите номер телефона партнёра или отправьте его контакт (удаление)"
admin_delete_admin = "Введите номер телефона админа или отправьте его контакт (удаление)"

admin_partner_also_is = "Данный партнёр уже был добавлен"
admin_partner_wrong_format = "Неверный формат."
admin_partner_accept = "Вы успешно добавили партнёра"
admin_partner_delete = "Вы успешно удалили партнёра"
admin_partner_isnot = "Партнёра с этим номером нет"

admin_admin_also_is = "Данный админ уже был добавлен"
admin_admin_isnot = "Админа с этим номером нет"
admin_admin_accept = "Вы успешно добавили админа"
admin_admin_delete = "Вы успешно удалили админа"


# аукцион
decline = "Мы огорчены случившимся. " \
          "Согласно нашим правилам, мы вынуждены заблокировать Вашу учетную запись. " \
          "Вы больше не сможете участвовать в наших аукционах. " \
          "Если Вы отказываетесь выкупить лот по веским причинам, " \
          "Вы можете обжаловать наше решение, связавшись с Менеджером Аукциона”"